// booklist.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    bookList: [
      {
        "name": "武侠之气运至尊",
        "des": "带神奇系统，看破高手之气运，杀敌夺宝，装逼打脸，无往不利，无往不利，神圣打了，强者为尊。战神龙浩天，飘雪监狱第一天才为兄弟所示。五千年后，龙傲天这是我给他做为守护的保持",
        "autor": "剑君十二离",
        "tag1": "潮流",
        "tag2": "小编力荐"
      },
      {
        "name": "武侠之气运至尊",
        "des": "带神奇系统，看破高手之气运，杀敌夺宝，装逼打脸，无往不利，无往不利，神圣打了，强者为尊。战神龙浩天，飘雪监狱第一天才为兄弟所示。五千年后，龙傲天这是我给他做为守护的保持",
        "autor": "剑君十二离",
        "tag1": "潮流",
        "tag2": "小编力荐"
      },
      {
        "name": "武侠之气运至尊",
        "des": "带神奇系统，看破高手之气运，杀敌夺宝，装逼打脸，无往不利，无往不利，神圣打了，强者为尊。战神龙浩天，飘雪监狱第一天才为兄弟所示。五千年后，龙傲天这是我给他做为守护的保持",
        "autor": "剑君十二离",
        "tag1": "潮流",
        "tag2": "小编力荐"
      },
      {
        "name": "武侠之气运至尊",
        "des": "带神奇系统，看破高手之气运，杀敌夺宝，装逼打脸，无往不利，无往不利，神圣打了，强者为尊。战神龙浩天，飘雪监狱第一天才为兄弟所示。五千年后，龙傲天这是我给他做为守护的保持",
        "autor": "剑君十二离",
        "tag1": "潮流",
        "tag2": "小编力荐"
      },
      {
        "name": "武侠之气运至尊",
        "des": "带神奇系统，看破高手之气运，杀敌夺宝，装逼打脸，无往不利，无往不利，神圣打了，强者为尊。战神龙浩天，飘雪监狱第一天才为兄弟所示。五千年后，龙傲天这是我给他做为守护的保持",
        "autor": "剑君十二离",
        "tag1": "潮流",
        "tag2": "小编力荐"
      },
      {
        "name": "武侠之气运至尊",
        "des": "带神奇系统，看破高手之气运，杀敌夺宝，装逼打脸，无往不利，无往不利，神圣打了，强者为尊。战神龙浩天，飘雪监狱第一天才为兄弟所示。五千年后，龙傲天这是我给他做为守护的保持",
        "autor": "剑君十二离",
        "tag1": "潮流",
        "tag2": "小编力荐"
      },
      {
        "name": "武侠之气运至尊",
        "des": "带神奇系统，看破高手之气运，杀敌夺宝，装逼打脸，无往不利，无往不利，神圣打了，强者为尊。战神龙浩天，飘雪监狱第一天才为兄弟所示。五千年后，龙傲天这是我给他做为守护的保持",
        "autor": "剑君十二离",
        "tag1": "潮流",
        "tag2": "小编力荐"
      },
      {
        "name": "武侠之气运至尊",
        "des": "带神奇系统，看破高手之气运，杀敌夺宝，装逼打脸，无往不利，无往不利，神圣打了，强者为尊。战神龙浩天，飘雪监狱第一天才为兄弟所示。五千年后，龙傲天这是我给他做为守护的保持",
        "autor": "剑君十二离",
        "tag1": "潮流",
        "tag2": "小编力荐"
      },
      {
        "name": "武侠之气运至尊",
        "des": "带神奇系统，看破高手之气运，杀敌夺宝，装逼打脸，无往不利，无往不利，神圣打了，强者为尊。战神龙浩天，飘雪监狱第一天才为兄弟所示。五千年后，龙傲天这是我给他做为守护的保持",
        "autor": "剑君十二离",
        "tag1": "潮流",
        "tag2": "小编力荐"
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})