// pages/stack/stack.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    stackList: [
      {
        "name": "玄幻",
        "numb": '共200850册'
      },
      {
        "name": "奇幻",
        "numb": '共37201册'
      },
      {
        "name": "武侠",
        "numb": '共19709册'
      },
      {
        "name": "仙侠",
        "numb": '共60321册'
      },
      {
        "name": "都市",
        "numb": '共100053册'
      },
      {
        "name": "现实",
        "numb": '共200850册'
      },
      {
        "name": "历史",
        "numb": '共200850册'
      },
      {
        "name": "军事",
        "numb": '共200850册'
      },
      {
        "name": "游戏",
        "numb": '共200850册'
      },
      {
        "name": "体育",
        "numb": '共200850册'
      },
      {
        "name": "科幻",
        "numb": '共200850册'
      },
      {
        "name": "灵异",
        "numb": '共200850册'
      },
      {
        "name": "二次元",
        "numb": '共200850册'
      },
      {
        "name": "短篇",
        "numb": '共200850册'
      }
    ],
    recommendList: [
      {
        "name": "小说",
        "numb": '共200850册'
      },
      {
        "name": "文学",
        "numb": '共200850册'
      },
      {
        "name": "青春文学",
        "numb": '共200850册'
      },
      {
        "name": "管理",
        "numb": '共200850册'
      },
      {
        "name": "经济",
        "numb": '共200850册'
      },
      {
        "name": "成功励志",
        "numb": '共200850册'
      },
      {
        "name": "投资理财",
        "numb": '共200850册'
      },
      {
        "name": "亲子家教",
        "numb": '共200850册'
      },
      {
        "name": "两性关系",
        "numb": '共200850册'
      },
      {
        "name": "保健养生",
        "numb": '共200850册'
      },
      {
        "name": "旅游地图",
        "numb": '共200850册'
      },
      {
        "name": "传记",
        "numb": '共200850册'
      },
      {
        "name": "时尚美妆",
        "numb": '共200850册'
      },
      {
        "name": "心理学",
        "numb": '共200850册'
      },
      {
        "name": "社会科学",
        "numb": '共200850册'
      },
      {
        "name": "历史",
        "numb": '共200850册'
      },
      {
        "name": "军事",
        "numb": '共200850册'
      },
      {
        "name": "文化",
        "numb": '共200850册'
      },
      {
        "name": "政治",
        "numb": '共200850册'
      },
      {
        "name": "教材教辅",
        "numb": '共200850册'
      },
      {
        "name": "童书",
        "numb": '共200850册'
      },
      {
        "name": "短篇",
        "numb": '共200850册'
      },
      {
        "name": "公版免费书",
        "numb": '共200850册'
      },
      {
        "name": "专栏",
        "numb": '共200850册'
      }
    ],
    girlList: [
      {
        "name": "古代言情",
        "numb": '共200850册'
      },
      {
        "name": "现代言情",
        "numb": '共200850册'
      },
      {
        "name": "玄幻言情",
        "numb": '共200850册'
      },
      {
        "name": "仙侠奇缘",
        "numb": '共200850册'
      },
      {
        "name": "浪漫青春",
        "numb": '共200850册'
      },
      {
        "name": "游戏竞技",
        "numb": '共200850册'
      },
      {
        "name": "悬疑灵异",
        "numb": '共200850册'
      },
      {
        "name": "N次元",
        "numb": '共200850册'
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})