// pages/rank/rank.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    selectIndex: 0,
    leftList: [
      { "title": "男生风云" },
      { "title": "男生10年" },
      { "title": "男生畅销" },
      { "title": "男生新书" },
      { "title": "男生完结" },
      { "title": "出版新书" },
      { "title": "出版畅销" },
      { "title": "女生风云" },
      { "title": "女生10年" },
      { "title": "女生畅销" },
      { "title": "女生新书" },
      { "title": "女生完结" }
    ],
    rightList: [
      {
        "name": "封神之帝皇系统",
        "des": "重生封神大世界，获得金手指系统。金手指1：神武--瞬间学会任何功法；金手指2：暴击",
        "autor": "黑三老匪",
        "tag1": "神话",
        "tag2": "1.7万月票"
      },
      {
        "name": "都市无敌协议",
        "des": "带神奇系统，看破高手之气运，杀敌夺宝，装逼打脸，无往不利！",
        "autor": "剑气八荒",
        "tag1": "秘术",
        "tag2": "16.9万月票"
      },
      {
        "name": "神级魔头",
        "des": "带神奇系统，看破高手之气运，杀敌夺宝，装逼打脸，无往不利！",
        "autor": "蓝魔药剂",
        "tag1": "东方玄幻",
        "tag2": "38.3万月票"
      },
      {
        "name": "封神之帝皇系统",
        "des": "重生封神大世界，获得金手指系统。金手指1：神武--瞬间学会任何功法；金手指2：暴击",
        "autor": "黑三老匪",
        "tag1": "神话",
        "tag2": "21.7万月票"
      },
      {
        "name": "都市无敌协议",
        "des": "带神奇系统，看破高手之气运，杀敌夺宝，装逼打脸，无往不利！",
        "autor": "剑气八荒",
        "tag1": "秘术",
        "tag2": "16.9万月票"
      },
      {
        "name": "神级魔头",
        "des": "带神奇系统，看破高手之气运，杀敌夺宝，装逼打脸，无往不利！",
        "autor": "蓝魔药剂",
        "tag1": "东方玄幻",
        "tag2": "38.3万月票"
      },
      {
        "name": "封神之帝皇系统",
        "des": "重生封神大世界，获得金手指系统。金手指1：神武--瞬间学会任何功法；金手指2：暴击",
        "autor": "黑三老匪",
        "tag1": "神话",
        "tag2": "21.7万月票"
      },
      {
        "name": "都市无敌协议",
        "des": "带神奇系统，看破高手之气运，杀敌夺宝，装逼打脸，无往不利！",
        "autor": "剑气八荒",
        "tag1": "秘术",
        "tag2": "16.9万月票"
      },
      {
        "name": "神级魔头",
        "des": "带神奇系统，看破高手之气运，杀敌夺宝，装逼打脸，无往不利！",
        "autor": "蓝魔药剂",
        "tag1": "东方玄幻",
        "tag2": "38.3万月票"
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  },

  /**
   * 点击左侧选中
   */
  onLeftClick: function (event){
    this.setData({ selectIndex: event.currentTarget.dataset.index});
  }
})