// help.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    content: " 1.QQ阅读小程序，能看到什么书？\n"
            +"　在小程序上，我们目前只提供完全免费的阅读，包"
    +"　含：\n"
    +"　(1)海量全本免费书籍；\n"
    +"　(2)收费书籍的免费试读章节，帮你了解一本书。\n\n"
    +"2.登录相关\n"
    +"　多次拒绝登录后，小程序不会主动弹出登录框。想\n"
    +"再登录，需要：\n"
    +"　(1)在微信的发现―小程序的内页，将“QQ阅读”小程序长按/左滑删除；\n"
    +"　(2)重新搜索进入“QQ阅读”小程序，才能再弹出提示登录的弹窗；\n"
    +"　(3)点击“允许，进行登录。\n\n"
            +"3.意见反馈，其它使用帮助\n"
    +"　欢迎加入我们的核心用户QQ群：565613069",
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})