// bookdetail.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    menuList: [
      "第1章 推荐序一",
      "第2章 推荐序二",
      "第3章 推荐序三",
      "第4章 序言(1)",
      "第5章 序言(2)",
      "第6章 序言(3)",
      "第7章 长尾市场(1)",
      "第8章 长尾市场(2)",
      "第9章 大热门的兴衰起伏(1)",
      "第10章 大热门的兴衰起伏(2)",
      "第11章 大热门的兴衰起伏(3)",
      "第12章 长尾简史(1)",
      "第13章 长尾简史(2)",
      "第14章 长尾的三种力量(1)",
      "第15章 长尾的第三种力量(2)",
      "第16章 新生产者(1)",
      "第17章 新生产者(2)"
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})